//打开微信界面
launchApp("微信");
toast("进入微信界面");
sleep(1000);

//选择用户，默认第一个，就是提供二维码的人，可置顶
press(382,351,111);
sleep(1000);

//点进聊天界面，选择最近的二维码
press(355,1020,111);
sleep(1000);

//长按
press(363,620,1000);
sleep(1000);

//识别图中二维码
press(250,1087,111);
toast("等待10秒加载");
sleep(10000);

//Swipe(350,500,350,200,3000);
//sleep(500);
//循环读取数据,发送全部
for(var i=1;i<=43;i++){
    //点击专题页
    press(373,625,111);
   // press(368,333,111);
    sleep(2000);
    //转发菜单
    press(555,105,111);
    sleep(2000);
    //转发按钮
    press(298,963,111);
    sleep(2000);
    //选择发送人
    press(346,456,111);
    sleep(2000);
    //发送
    press(539,971,111);
    toast("发送第"+i+"条成功");
    sleep(2000);
    //返回
    press(48,102,111);
    sleep(1000);
    //滑动
    Swipe(350,760.4,350,372.7,4000);//商品间距372.7
    sleep(6000);
}

//退出小程序
press(675,95,111);

//退出聊天
press(35,115,111);